10 INPUT"Если Вы мужчина, то нажмите клавишу 'SHIFT'+'1',а если Вы женщина, то нажмите клавишу 'клюшка'";X%
20 INPUT "Укажите Ваш рост в метрах";L
30 INPUT"Укажите обхват запястья сильнейшей руки в см";Y
35 PRINT"Ваш идеальный вес:"
40 IF X%=1 THEN IF Y>18 THEN PRINTUSING"###.###";(L/.0254*4-128)*.4536*1.1;ELSE PRINTUSING "###.###"; (L/.0254*4-128)*.4536;ELSE IF Y>16.5 THEN PRINTUSING "###.###";(L/.0254*3.5-108)*.4536*1.1;ELSE PRINTUSING "###.###";(L/.0254*3.5-108)*.4536;
50 PRINT " кг":END
